{
  "title": "Android Engine on the way?",
  "fileName": "0004-Android-Engine-on-the-way?.md",
  "dateTime": "2013-03-28 17:56:48",
  "tags": [
    "Android"
  ],
  "components": [
    {
      "type": "paragraph",
      "text": "For a while I've wanted to make a simple game in Android. I've done simple apps before, such as a scalable test app for A* Pathfinding (which I will write about later) and silly soundboards, but nothing that can actually be played like a game."
    },
    {
      "type": "paragraph",
      "text": "The main element any game needs is a 2D canvas on which all the graphics are drawn. It is understanding how to make one, update the contents and render it that kept me back. I've also created a few simple Live Wallpapers, but with these all the hard work is done for you by extending an existing class, <code>android.service.wallpaper.WallpaperService</code> (and in-turn extending <code>WallpaperService.Engine</code>)."
    },
    {
      "type": "paragraph",
      "text": "In order to create an interactive graphical experience outside a pre-built Live Wallpaper Engine, I had to understand how Android handles Canvases, drawing calls and how these are displayed. I had tried doing a similar <code>update() -> render() -> fpsDelay()</code> approach as in my Java games, but an endless loop such as this created in the Constructor of an Android app halts everything."
    },
    {
      "type": "paragraph",
      "text": "And I mean everything."
    },
    {
      "type": "paragraph",
      "text": "You can't do any other work in an Android app until the Constructor is done, unlike Java. This is because all the drawing activity is done asynchronously AFTER the application has been created (that is, <code>onCreate()</code> has completed)."
    },
    {
      "type": "paragraph",
      "text": "To get round this, I found out I could extend <code>SurfaceView</code> and call my <code>update()</code> function in the <code>onDraw()</code> call to keep a cycle going. After some attempts at this, I am pleased to discover it works! Maybe I could make a port of 'dungeons' or something similar..."
    },
    {
      "type": "paragraph",
      "text": "Here is a screenshot from my AVD (Android 2.3.3 Gingerbread), next to a screenshot from my Galaxy S (Android 4.1.2 Jelly Bean, thanks to <a title=\"Cyanogenmod\" href=\"http://www.cyanogenmod.org/\">Cyanogenmod</a>) running the engine:"
    },
    {
      "type": "paragraph",
      "text": "<a href=\"http://ninedof.files.wordpress.com/2013/03/enginetestfpsemu.png\">!<a class=\"link\" target=\"_blank\" href=\"http://ninedof.files.wordpress.com/2013/03/enginetestfpsemu.png?w=545\"></a></a>"
    },
    {
      "type": "paragraph",
      "text": "You can see that performance is much greater on actual hardware!"
    },
    {
      "type": "paragraph",
      "text": "In the end, the line that gave me most trouble was <em>not</em> including this:"
    },
    {
      "type": "paragraph",
      "text": "<code>setWillNotDraw(false);</code>"
    },
    {
      "type": "paragraph",
      "text": "Huh."
    },
    {
      "type": "paragraph",
      "text": "I also found that after I'd 'closed' the app, my phone was extremely unresponsive until I re-opened it and killed it manually. Hence, this is needed for now:"
    },
    {
      "type": "paragraph",
      "text": "<code>\n@Override\npublic void onPause() {\n    finish();\n}\n</code>"
    },
    {
      "type": "paragraph",
      "text": "Which causes a Force Close but I can live with that for now."
    }
  ]
}