{
  "title": "New Pebble Watch Face: Split Horizon",
  "fileName": "2013-06-03-New-Pebble-Watch-Face-Split-Horizon.md",
  "dateTime": "2013-06-03 17:19:34",
  "tags": [
    "Pebble"
  ],
  "components": [
    {
      "type": "paragraph",
      "text": "Over the last year or so since I installed CM10.0 to my Galaxy S, I've noticed that it's become very sluggish, sometimes to the point of being completely unresponsive. However, this seems to happen in fits and bouts, so I reflashed CM10.0 and installed the bare minimum apps I regularly use, and once again I'm amazed how slick and responsive it is. Goes to show that a single core 1GHz Snapdragon with 358MB RAM is more than enough for a fast, snappy Android experience, if your phone hasn't accumulated a years worth of bulk and mess behind the scenes."
    },
    {
      "type": "paragraph",
      "text": "Anyway, as I was looking through the list of apps on the <del>Market</del> Play Store to reinstall, I saw a very old live wallpaper that hadn't been maintained in over two years. It inspired me to create another watch face, which I have named 'Split Horizon', and it looks something like this:"
    },
    {
      "type": "image",
      "description": "",
      "src": "/assets/import/media/2013/06/sh-preview.png"
    },
    {
      "type": "paragraph",
      "text": "Every 15 seconds, one of the four top markers slides into view, then on the minute two InverterLayers slide in like a camera shutter and retract again once the time changes."
    },
    {
      "type": "paragraph",
      "text": "It also comes in two other editions:"
    },
    {
      "type": "paragraph",
      "text": "Minutes Edition (without the top 15 second markers)\nPlain Edition (just the design without any animation at all)"
    },
    {
      "type": "paragraph",
      "text": "Source code for all three editions plus install packages can <a title=\"Source Code\" href=\"https://www.dropbox.com/s/cyeegx9l9fsg230/Split%20Horizon%20Source%20and%20Bundle.zip\">be found here</a>."
    },
    {
      "type": "paragraph",
      "text": "&nbsp;"
    }
  ]
}