{
  "title": "Android Engine Update",
  "fileName": "2013-07-08-Android-Engine-Update.md",
  "dateTime": "2013-07-08 11:50:28",
  "tags": [
    "Android"
  ],
  "components": [
    {
      "type": "paragraph",
      "text": "So, <a title=\"Android Engine on the way?\" href=\"http://ninedof.wordpress.com/2013/03/28/android-engine-on-the-way/\">a while ago now</a> I created an iterative Android game engine, and used it to <a title=\"Raiders for Android\" href=\"http://ninedof.wordpress.com/2013/03/31/raiders-for-android/\">port Raiders</a>. It went pretty well, and I got good performance out of it. But an almost inevitable truth I have come to accept in starting a new project based off an old (This time being porting Railways to Android) is that by the time I revisit the old code, I've learned so much more that it makes me wince to even read it."
    },
    {
      "type": "paragraph",
      "text": "There have been occasions where I've reduced the size of a source file by <strong>three times</strong> or more, simply by applying much more precise implementation conventions. It ends up faster, more memory efficient and easier to read and tweak. This is all good!"
    },
    {
      "type": "paragraph",
      "text": "While I was contemplating this new port, it occurred to me I could make things a lot simpler for myself by creating a general <code>Engine</code> class, and simply extending it whenever I wanted a specific game implemented."
    },
    {
      "type": "paragraph",
      "text": "The general philosophy I've adopted for making games on Java and Android has been an iterative game loop and render loop. This means that for each frame, every in-game object gets one <code>update()</code> call (so move once etc), then one <code>render()</code> call to draw it. When the Java engine was made threaded, performance increased even more, but the same could not be applied to my Android phone, which is only single core. After an attempted implementation, performance was pretty inconsistent, which I chalked up to perhaps the constant changing of Thread context. We may never know."
    },
    {
      "type": "paragraph",
      "text": "Getting back to the new ideas, I've cleaned up my Android engine to the point where the state machine is internalised along with all the touch IO. To implement a new 'menu <-> in-game' style game all I have to do now is extend the engine and override six functions:"
    },
    {
      "type": "paragraph",
      "text": "• <code>loadMenuMembers()</code> - Allocate all objects that appear in the menu"
    },
    {
      "type": "paragraph",
      "text": "• <code>loadGameMembers()</code> - Allocate all objects that appear in-game"
    },
    {
      "type": "paragraph",
      "text": "• <code>menuUpdateLoop()</code> - Update all interactive objects in the menu"
    },
    {
      "type": "paragraph",
      "text": "• <code>gameUpdateLoop()</code> - Update all the interactive objects in-game"
    },
    {
      "type": "paragraph",
      "text": "• <code>menuRenderLoop()</code> - Render all the menu objects"
    },
    {
      "type": "paragraph",
      "text": "• <code>gameRenderLoop()</code> - Render all the in-game objects"
    },
    {
      "type": "paragraph",
      "text": "These functions are called at the appropriate times by the superclass engine, and so the rest can be ignored by the coder, leaving them to focus on only the elements of their game."
    },
    {
      "type": "paragraph",
      "text": "Much simpler!"
    }
  ]
}