{
  "fileName": "2020-09-27-Integrated-Pi-Enclosure.md",
  "title": "Integrated Raspberry Pi Enclosure",
  "dateTime": "2020-09-27 14:06",
  "tags": [
    "Raspberry Pi"
  ],
  "components": [
    {
      "type": "paragraph",
      "text": "The normal way for a Raspberry Pi enthusiast to use their miniature computer is\nto attach a mouse, keyboard, power supply, display of some kind, and then to\ndisconnect all these cables and peripherals and put them away again. Unless they\nuse SSH, which makes things a bit less messy."
    },
    {
      "type": "paragraph",
      "text": "A few weeks ago I stumbled across the concept of enclosures for Raspberry Pi\nthat try and solve this problem by combining one or more peripherals into the\ncase or enclosure itself. Sometimes as far as an included keyboard, battery\npack, etc. I was inspired by this, having done a little CAD design for laser-cut\nacylic back in school, and designed to play around in\n<a class=\"link\" target=\"_blank\" href=\"https://www.tinkercad.com\">Tinkercad</a> to see what I came up with."
    },
    {
      "type": "header",
      "level": 2,
      "text": "Design"
    },
    {
      "type": "paragraph",
      "text": "Over a few days I pieced together some panels and corner pieces to 3D print. I\nfound that by also modelling the interior components (Pi itself, Waveshare\ndisplay, internal bulk of the panel-mount extension cables) I could accurately\nsize the enclosure and place holes for screws and bolts to hold it all together."
    },
    {
      "type": "image",
      "description": "",
      "src": "assets/media/2020/09/cad.png"
    },
    {
      "type": "header",
      "level": 2,
      "text": "Assembly"
    },
    {
      "type": "paragraph",
      "text": "Over the next couple of weeks I ordered the panels to be laser-cut by a small\ncompany specialising in laser cutting and engraving (and would accept orders\nsmaller than 100!), and used my brother's 3D printer to print the corner pieces.\nOnce the panel mount cables arrived, I realised that the gaps and bolt holes\nwere wrong, and so had to re-order a couple of panels - a learning process\nindeed."
    },
    {
      "type": "paragraph",
      "text": "Finally, assembly was complete. I'm happy with the size, and the\nslight use of color to accentuate the design. It's slightly heftier than I\npredicted, but that's nice in a way."
    },
    {
      "type": "image",
      "description": "",
      "src": "assets/media/2020/09/done-upright.jpg"
    },
    {
      "type": "paragraph",
      "text": "It even works laying down if needed:"
    },
    {
      "type": "image",
      "description": "",
      "src": "assets/media/2020/09/done-flat.jpg"
    },
    {
      "type": "paragraph",
      "text": "There was just enough space inside for the cables to fit and loop around where\nnecessary. The thicker the cable, the more difficult to fit in, but none were\ntoo bulky to fit at all."
    },
    {
      "type": "image",
      "description": "",
      "src": "assets/media/2020/09/cables.jpg"
    },
    {
      "type": "paragraph",
      "text": "Keen-eyed readers will see one cable is looking a bit hacked about, and that is\nbecause it has been. In order to make at least one of the three top switches\nfunctional (the plan was for one used for power, display, and software trigger)\nI very carefully split open the input power USB cable and added detatchable\nwires so it acts as a power control. An anxiety-inducing operation, but happily\na success!"
    },
    {
      "type": "image",
      "description": "",
      "src": "assets/media/2020/09/solder.jpg"
    },
    {
      "type": "header",
      "level": 2,
      "text": "Bonus photos"
    },
    {
      "type": "paragraph",
      "text": "The panel mount extension cables look very nice with their contrasting chome\nscrews, lined up with enough space to plug things in as needed, such as a mouse\n(though the display is a capacitative touch screen), keyboard, USB thumb drive\nor 4G model for example."
    },
    {
      "type": "image",
      "description": "",
      "src": "assets/media/2020/09/sockets.jpg"
    },
    {
      "type": "paragraph",
      "text": "The three top switches have enough travel to push through from the back of the\nfront panel and the additional red piece of detailing which makes the display\ncompletely flush with the front surface. Soon, the plan is to splice another USB\nwire to enable the display to be turned on/off independantly, and the third\nswitch to trigger a Python script. For example, <code>startx</code> when ON, and\nan equivalent command to drop back to the terminal."
    },
    {
      "type": "image",
      "description": "",
      "src": "assets/media/2020/09/switches.jpg"
    }
  ]
}