{
  "fileName": "2021-12-20-Reminders-As-You-Code-With-todo-cli.md",
  "title": "Reminders As You Code With todo-cli",
  "dateTime": "2021-12-20 20:23",
  "tags": [
    "JavaScript",
    "Releases"
  ],
  "components": [
    {
      "type": "paragraph",
      "text": "Frequently in my day to day work time I find myself making notes of small things\nto do when I have some free time betwen meetings or other tasks. It's time\nconsuming to be constantly switching contexts to do these at the time they come\nup, so I used to write them down on a note pad on my desk to serve as a reminder\nfor things to do when time was available."
    },
    {
      "type": "paragraph",
      "text": "Sadly, that pad is in the office in London, and I don't work there as much\nanymore. I'm usually good at remembering things, but if I want to be sure I\nwon't forget, I'll put it in my calendar, or in Google Keep, etc. But even then\nthere is a chance that once those one-off reminders come and go I'll still\nforget to do the things I was orignally reminding myself of."
    },
    {
      "type": "paragraph",
      "text": "I needed a way to repeatedly remind my self what tasks or promises I had\ndeferred until I had actually done them, in a place where I would be sure to\nsee them - why not the terminal? So after a little prototyping we have\n(probably one of many that already exist) a terminal-based tool to track small\ntasks and serve reminders - <code>todo-cli</code>."
    },
    {
      "type": "image",
      "description": "",
      "src": "assets/media/2021/12/cli.png"
    },
    {
      "type": "paragraph",
      "text": "It's designed to integrate into my existing setup - using\n<code>.bash_profile</code> to remind me again every time I start a new terminal\nsession which is usually a few times a day."
    },
    {
      "type": "paragraph",
      "text": "The commands are simple: "
    },
    {
      "type": "paragraph",
      "text": "<table>\n      <tr>\n        <td style=\"padding-right:10px\">•</td>\n        <td><code>todo add $message</code> to add a new item.</td>\n      </tr>\n    </table>"
    },
    {
      "type": "paragraph",
      "text": "<table>\n      <tr>\n        <td style=\"padding-right:10px\">•</td>\n        <td><code>todo list</code> to show all existing items.</td>\n      </tr>\n    </table>"
    },
    {
      "type": "paragraph",
      "text": "<table>\n      <tr>\n        <td style=\"padding-right:10px\">•</td>\n        <td><code>todo update $index $message</code> to update an existing item.</td>\n      </tr>\n    </table>"
    },
    {
      "type": "paragraph",
      "text": "<table>\n      <tr>\n        <td style=\"padding-right:10px\">•</td>\n        <td><code>todo done $index</code> to mark an item as complete and remove it.</td>\n      </tr>\n    </table>"
    },
    {
      "type": "paragraph",
      "text": "Each command has a short-form equivalent too, such as <code>todo l</code> to\nlist, or <code>todo a $message</code> to add a new item."
    },
    {
      "type": "image",
      "description": "",
      "src": "assets/media/2021/12/cli-items.png"
    },
    {
      "type": "paragraph",
      "text": "In this way, I can view, quickly add and check off items as I complete them,\nand be reminded once only when I begin a new terminal (when I'm usually\nswitching) contexts anyway, which could be a suitable time to quickly check\na task off the list."
    },
    {
      "type": "paragraph",
      "text": "As you can see above from the example <code>list</code> output, there is a\nconfigurable feature to mark items in red if they exist for too long since they\nwere added. By default this is three days, but it will be different for\ndifferent people. I actually imagine that the time-sensitivity would be unique\nto the actual task, but that granularity can be deferred for a future update."
    },
    {
      "type": "paragraph",
      "text": "On to the todo list it goes!"
    },
    {
      "type": "header",
      "level": 2,
      "text": "Conclusion"
    },
    {
      "type": "paragraph",
      "text": "I've been using this successfully for a couple of weeks now, as opposed to other\nside projects that are fun to develop but then lay in a repository unused. And\nit has genuinely made me better at remembering and fufilling all those small\n\"I'll do it a bit later\" tasks or things I promise to do for my colleagues in\na reasonably timely manner, so I'm confident it will get even more usage into\nthe new year and beyond."
    },
    {
      "type": "paragraph",
      "text": "As always, you can see the <a class=\"link\" target=\"_blank\" href=\"https://github.com/c-d-lewis/todo-cli\">repository</a>\nand install it yourself to give it a try and hopefully help you with similar\ntasks."
    },
    {
      "type": "paragraph",
      "text": "<div class=\"lang-label lang-text\">Text</div>\n<pre><div class=\"code-block\">\nnpm i -g @chris-lewis/todo-cli\n</div></pre>"
    }
  ]
}